/*
4а: (25%) Дадена е матрица 9 Х 9 клетки. Да се провери дали матрицата е
коректно попълнено Судоку.
Коректно попълнено Судоку е:
- матрица, съставена само от числата от 0 до 9
- матрицата има 9 подматрици, всяка 3 х 3 и за всяка
подматрица е спазено правилото да няма повтарящо се число
- няма повтаряне на числа във всеки ред на матрицата
- няма повтаряне на числа във всяка колона на матрицата
*/

let sudoku = [
    [5,3,4,6,7,8,9,1,2],
    [6,7,2,1,9,5,3,4,8],
    [1,9,8,3,4,2,5,6,7],
    [8,5,9,7,6,1,4,2,3],
    [4,2,6,8,5,3,7,9,1],
    [7,1,3,9,2,4,8,5,6],
    [9,6,1,5,3,7,2,8,4],
    [2,8,7,4,1,9,6,3,5],
    [3,4,5,2,8,6,1,7,9]
];

let isSudoku = false;

for (let i=0; i<sudoku.length; i++) {
    let row = 0;
    let colum = 0;

    for (let j=0; j<sudoku[i].length; j++) {

        row += sudoku[i][j];
        colum += sudoku[j][i];

    }

    if (row !== 45 || colum !== 45) {
        isSudoku = false;
        break;
    } else {
        isSudoku = true;
    }

    row = 0;
    colum = 0;
}

console.log(isSudoku)

